{
  "table": {
    "caption": "Table 22 — Standard security handler user access permissions",
    "head": [
      "Bit position",
      "Meaning"
    ],
    "rows": [
      [
        "1 - 2",
        "Reserved. Must be zero (0)."
      ],
      [
        "3",
        "(Security handlers of revision 2) Print the document.\n(Security handlers of revision 3 or greater) Print the document (possibly not at the highest quality level, depending on whether bit 12 is also set)."
      ],
      [
        "4",
        "Modify the contents of the document by operations other than those controlled by bits 6, 9, and 11."
      ],
      [
        "5",
        "Copy or otherwise extract text and graphics from the document. However, for the limited purpose of providing this content to assistive technology, a PDF reader behaves as if this bit was set to 1.\nNOTE For accessibility, ISO 32000-1 had this option restricted by bit 10, but that exception has been deprecated in PDF 2.0."
      ],
      [
        "6",
        "Add or modify text annotations, fill in interactive form fields, and, if bit 4 is also set, create or modify interactive form fields (including signature fields)."
      ],
      [
        "7 - 8",
        "Reserved. Must be 1."
      ],
      [
        "9",
        "(Security handlers of revision 3 or greater) Fill in existing interactive form fields (including signature fields), even if bit 6 is clear."
      ],
      [
        "10",
        "Not used. This bit was previously used to determine whether content could be extracted for the purposes of accessibility, however, that restriction has been deprecated in PDF 2.0. PDF readers ignores this bit and PDF writers always set this bit to 1 to ensure compatibility with PDF readers following earlier specifications."
      ],
      [
        "11",
        "(Security handlers of revision 3 or greater) Assemble the document (insert, rotate, or delete pages and create document outline items or thumbnail images), even if bit 4 is clear."
      ],
      [
        "12",
        "(Security handlers of revision 3 or greater) Print the document to a representation from which a faithful digital copy of the PDF content could be generated, based on an implementation-dependent algorithm. When this bit is clear (and bit 3 is set), printing is limited to a low-level representation of the appearance, possibly of degraded quality."
      ],
      [
        "13 - 32",
        "(Security handlers of revision 3 or greater) Reserved. Must be 1."
      ]
    ]
  }
}